{
  "backend/main.mo": "Main Motoko actor defining data types (UserProfile, Transaction, BankAccount, Challenge, Feedback, SupportTicket) and CRUD endpoints for profile management, bank accounts, transactions, challenges, feedback, and leaderboard, with role-based access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades stored UserProfile records from the old schema (missing walletBalance) to the new schema by adding a default walletBalance of 0.",
  "feature_evidence.json": "Feature evidence report mapping three wallet-related features (Home wallet section, Profile wallet section, QR code modal) to their implementation files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for component and hook responsibilities across the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the FinMate React app, mounting the app into a root div and loading the TypeScript entry point via a module script.",
  "frontend/src/App.tsx": "Root React component managing the full authentication and onboarding flow: Internet Identity login, PIN setup/entry, profile setup modal, and rendering MainApp once the user is authenticated and unlocked.",
  "frontend/src/components/AdBanner.tsx": "An auto-rotating advertisement banner carousel that cycles through 5 financial product ads every 4 seconds, with manual navigation arrows and dot indicators.",
  "frontend/src/components/AddBankAccountModal.tsx": "A modal dialog form for linking a new bank account, collecting bank name, account number, account type, and balance, then submitting via the useAddBankAccount mutation.",
  "frontend/src/components/AdminFeedbackSection.tsx": "An admin-only section that fetches and displays all user-submitted feedback entries with star ratings, messages, timestamps, and submitter principal IDs.",
  "frontend/src/components/AdminSupportTicketsSection.tsx": "An admin-only section that lists all support tickets with subject, description, ticket ID badge, submitter principal, and submission date.",
  "frontend/src/components/AIChatbotFAB.tsx": "Floating action button component that toggles the AIChatbotOverlay open or closed, displaying an AI avatar image with a fallback icon.",
  "frontend/src/components/AIChatbotOverlay.tsx": "A floating chat overlay component that renders a conversation UI with the FinMate AI assistant, supporting quick-reply buttons, markdown-style bold text rendering, and auto-scrolling messages.",
  "frontend/src/components/BalanceCard.tsx": "A card that shows the total balance across linked bank accounts, hidden by default behind a PIN confirmation modal, with auto-hide after 30 seconds of visibility.",
  "frontend/src/components/BottomNav.tsx": "A fixed bottom navigation bar with four tabs (Home, History, Analytics, Profile) that highlights the active tab with an icon, label, and indicator dot.",
  "frontend/src/components/CategoryBreakdownCard.tsx": "Card component displaying a spending category with its icon, amount, percentage of total, and a trend indicator (up/down/neutral) with color-coded styling.",
  "frontend/src/components/ChallengesSection.tsx": "Displays a list of spending/savings challenges with real-time progress calculated from transactions, a leaderboard button, and fallback mock challenges if none are loaded.",
  "frontend/src/components/CIBILScoreSection.tsx": "Collapsible section displaying a simulated CIBIL credit score (742/900) with a gauge image, progress bar, score breakdown grid, and a list of improvement tips with impact levels.",
  "frontend/src/components/CustomerFeedbackSection.tsx": "Feedback form with a 5-star rating selector and optional text area that submits via the useSubmitFeedback mutation, showing a thank-you confirmation on success.",
  "frontend/src/components/FinMateWalletCard.tsx": "Gradient wallet card showing balance (with show/hide toggle), wallet ID, and Send/Receive/QR action buttons that open WalletQRModal and ScanPayModal.",
  "frontend/src/components/GetHelpSection.tsx": "Collapsible help section with an FAQ accordion, a live chat support button, and a support ticket form that submits via useSubmitSupportTicket with a success confirmation state.",
  "frontend/src/components/LanguageSelectionSection.tsx": "Collapsible language picker listing 9 languages with flags; persists the selection to localStorage and shows a notice that only English is currently supported.",
  "frontend/src/components/LeaderboardModal.tsx": "Displays a modal dialog showing a mock DigiPoints leaderboard with top 5 ranked users, and appends the currently logged-in user's rank and points at the bottom.",
  "frontend/src/components/PinConfirmationModal.tsx": "Renders a PIN entry modal with a numeric keypad that verifies a 4-digit PIN using the usePinAuth hook, calling onSuccess on match or showing an error on failure.",
  "frontend/src/components/ProfileSetupModal.tsx": "A one-time profile setup modal that collects the user's name and optional email, then saves the profile via the saveCallerUserProfile mutation with a generated referral code.",
  "frontend/src/components/RechargeModal.tsx": "A multi-step mobile recharge modal that lets users enter a phone number, select prepaid or postpaid plans, and confirm payment via PIN, ending with a success screen.",
  "frontend/src/components/RewardsSection.tsx": "An expandable card section displaying the user's referral code (with copy functionality) and a list of exclusive brand discount offers with copyable promo codes.",
  "frontend/src/components/ScanPayModal.tsx": "A send-money modal supporting QR code scanning (via camera), mobile number, or UPI ID input, with amount entry and PIN confirmation before completing the payment.",
  "frontend/src/components/SecuritySettingsModal.tsx": "A modal dialog for security settings with tabs for changing PIN (via numpad flow) and managing active sessions, using mock session data and the usePinAuth hook.",
  "frontend/src/components/SetLimitsModal.tsx": "A modal dialog that allows users to set monthly spending limits per transaction category, with numeric inputs and save/cancel actions.",
  "frontend/src/components/SpendingLimitsCard.tsx": "A card component that displays per-category monthly spending progress bars against user-defined limits stored in localStorage, with a button to open the SetLimitsModal.",
  "frontend/src/components/TicketBookingModal.tsx": "A multi-step modal for booking bus, train, or flight tickets with mock route data, seat selection, PIN confirmation, and a success screen.",
  "frontend/src/components/TransactionCard.tsx": "A presentational card component that displays a single transaction's category icon, merchant name, date, and color-coded debit/credit amount.",
  "frontend/src/components/WalletQRModal.tsx": "A modal that renders a wallet ID as an SVG QR code (generated via a custom qrcode lib) and provides copy/share actions for receiving payments.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAIChatbot.ts": "Defines a React hook for a rule-based AI chatbot that matches user input keywords to predefined financial advice responses covering spending, investments, savings, budgeting, credit, and more.",
  "frontend/src/hooks/useBeneficiaries.ts": "Manages a list of payment beneficiaries (mobile/UPI) persisted in localStorage, exposing add and remove operations via a React hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP using AuthClient, providing a React context and hook with login, logout, and identity state management including delegation validity checks.",
  "frontend/src/hooks/usePinAuth.ts": "Handles PIN-based authentication with localStorage persistence using a simple hash, and exposes helpers for setting, verifying, and clearing the PIN as well as simulated biometric authentication.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data operations including user profile, bank accounts, and transactions, wrapping actor calls with proper caching and invalidation logic.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, and defines OKLCH-based CSS custom properties for light and dark themes along with reusable component utility classes.",
  "frontend/src/lib/qrcode.ts": "A pure TypeScript QR code generator with no external dependencies that produces a 2D boolean matrix for a given string. Implements Reed-Solomon error correction and supports versions 1-10 in byte mode with error correction level L.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity authentication providers wrapping the root App component.",
  "frontend/src/pages/Analytics.tsx": "Analytics page displaying spending breakdowns via pie and bar charts (Recharts) with weekly/monthly/yearly period toggles and demo data. Includes an AI chatbot panel with quick-reply suggestions powered by the useAIChatbot hook.",
  "frontend/src/pages/History.tsx": "Transaction history page with filtering by time period, category, transaction type (debit/credit), and a text search. Displays filtered transactions using TransactionCard components and shows total debit/credit summaries.",
  "frontend/src/pages/Home.tsx": "Home dashboard page showing a greeting, wallet card, quick-action buttons (recharge, tickets, send money, balance), ad banner, spending limits, challenges, and customer feedback sections. Manages modal visibility state for several feature modals.",
  "frontend/src/pages/LoginScreen.tsx": "Login screen presenting the FinMate branding, feature highlights, and an Internet Identity login button. Handles loading state during authentication and includes a footer attribution.",
  "frontend/src/pages/MainApp.tsx": "Root layout component that manages tab navigation state and renders the active page (Home, History, Analytics, or Profile) above a persistent BottomNav bar.",
  "frontend/src/pages/PinEntry.tsx": "PIN entry screen component that renders a numeric keypad, PIN dot indicators, error messages, and a biometric authentication button for unlocking the app.",
  "frontend/src/pages/PinSetup.tsx": "Two-step PIN setup screen where users create and confirm a 4-6 digit PIN, with a numeric keypad and validation logic.",
  "frontend/src/pages/Profile.tsx": "Profile page displaying user info, bank accounts, leaderboard preferences, theme toggle, wallet QR modal, and logout; uses multiple query hooks to fetch and update data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, shadows, and FinMate brand colors, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking existing features (wallet section on Home/Profile, per-user QR code) and pending feature requests (backend walletBalance field, query hook updates) for the Fimate finance app."
}