{
  "backend/main.mo": "Main Motoko actor for the FinMate backend, defining data types (UserProfile, Transaction, BankAccount, Challenge, Feedback, SupportTicket) and CRUD operations for profiles, bank accounts, transactions, challenges, feedback, support tickets, and a leaderboard, with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping the 'Check Balance' PIN/biometric authentication feature to its relevant source files (PinConfirmationModal.tsx and Home.tsx) and associated components and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React components, pages, and hooks.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point for the FinMate Vite/React app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Top-level React component managing the authentication and onboarding flow: handles Internet Identity login, PIN setup/entry, biometric unlock, profile setup modal, and renders MainApp once fully authenticated.",
  "frontend/src/components/AdBanner.tsx": "Auto-rotating ad banner carousel with 5 financial product ads, supporting manual navigation via arrows and dot indicators, cycling every 4 seconds.",
  "frontend/src/components/AddBankAccountModal.tsx": "Modal dialog for adding a bank account with fields for bank name, account number (masked to last 4 digits), account type, and balance, submitting via a mutation hook.",
  "frontend/src/components/AdminFeedbackSection.tsx": "Admin-only section that fetches and displays all user feedback entries with star ratings, messages, timestamps, and submitter principal IDs.",
  "frontend/src/components/AdminSupportTicketsSection.tsx": "Admin-only section that lists all support tickets with subject, description, ticket ID badge, submitter principal, and timestamp.",
  "frontend/src/components/AIChatbotFAB.tsx": "Floating action button component that toggles the AIChatbotOverlay open or closed, displaying an AI avatar image with a fallback icon.",
  "frontend/src/components/AIChatbotOverlay.tsx": "Full-screen chat overlay component for the FinMate AI assistant, rendering a scrollable message thread with markdown-style bold support, quick-reply shortcuts, and a text input for sending messages via the useAIChatbot hook.",
  "frontend/src/components/BalanceCard.tsx": "Displays total bank balance hidden by default, revealed after PIN confirmation via a modal, with auto-hide after 30 seconds.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (Home, History, Analytics, Profile) that highlights the active tab with an icon and indicator dot.",
  "frontend/src/components/CategoryBreakdownCard.tsx": "Card component displaying a spending category with icon, amount, percentage of total, and a trend indicator (up/down/neutral) with color coding.",
  "frontend/src/components/ChallengesSection.tsx": "Displays a list of spending/savings challenges with progress bars calculated from the current month's transactions, and includes a button to open a leaderboard modal. Falls back to mock challenges if none are returned from the backend.",
  "frontend/src/components/CIBILScoreSection.tsx": "Collapsible section showing a simulated CIBIL credit score (742/900) with a gauge image, progress bar, score breakdown grid, and improvement tips.",
  "frontend/src/components/CustomerFeedbackSection.tsx": "Renders a star-rating feedback form with an optional text area that submits user feedback via the `useSubmitFeedback` mutation, then shows a thank-you confirmation on success.",
  "frontend/src/components/FinMateWalletCard.tsx": "Displays a styled wallet card showing the user's FinMate wallet balance with show/hide toggle, and provides Send, Receive, and QR code action buttons that open corresponding modals.",
  "frontend/src/components/GetHelpSection.tsx": "Collapsible help section containing an FAQ accordion, a live chat support button, and a support ticket submission form that calls `useSubmitSupportTicket` on submit.",
  "frontend/src/components/LanguageSelectionSection.tsx": "Collapsible language selector that lets users pick from nine languages, persisting the choice to localStorage, while noting that only English is currently fully supported.",
  "frontend/src/components/LeaderboardModal.tsx": "Modal dialog showing a mock DigiPoints leaderboard with top-5 ranked users, plus a highlighted entry for the currently logged-in user fetched via `useGetCallerUserProfile`.",
  "frontend/src/components/PinConfirmationModal.tsx": "A modal dialog that prompts the user to enter a 4-digit PIN or use biometric authentication, verifying credentials via the usePinAuth hook before calling an onSuccess callback.",
  "frontend/src/components/ProfileSetupModal.tsx": "A one-time profile setup modal that collects the user's name and optional email, then saves the profile (with a generated referral code) using the saveCallerUserProfile mutation.",
  "frontend/src/components/RechargeModal.tsx": "A multi-step modal for mobile recharge that lets users enter or pick a phone number from mock contacts, select a prepaid/postpaid plan, confirm with a PIN, and shows a success screen.",
  "frontend/src/components/RewardsSection.tsx": "A collapsible section that displays the user's referral code (fetched from their profile) and a list of hardcoded brand offers with copyable promo codes.",
  "frontend/src/components/ScanPayModal.tsx": "A send-money modal supporting QR code scanning (via useQRScanner), mobile number, or UPI ID input, with PIN confirmation before completing the payment flow.",
  "frontend/src/components/SecuritySettingsModal.tsx": "A security settings modal with tabs for changing the user's PIN (via a multi-step numpad flow), toggling biometric authentication, and managing/revoking active device sessions.",
  "frontend/src/components/SetLimitsModal.tsx": "A modal dialog component that allows users to set monthly spending limits per transaction category, with inputs for each category and save/cancel actions.",
  "frontend/src/components/SpendingLimitsCard.tsx": "A card component that displays per-category monthly spending progress bars against user-defined limits, with limits persisted to localStorage and editable via SetLimitsModal.",
  "frontend/src/components/TicketBookingModal.tsx": "A multi-step modal for booking bus, train, or flight tickets with hardcoded sample routes, PIN confirmation, and a success screen.",
  "frontend/src/components/TransactionCard.tsx": "A presentational card component that renders a single transaction's category icon, merchant name, date, and formatted debit/credit amount.",
  "frontend/src/components/WalletQRModal.tsx": "A modal that generates and displays a QR code for a wallet ID using an SVG renderer, with copy and share actions for receiving payments.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAIChatbot.ts": "A hook providing a keyword-based AI chatbot with hardcoded responses covering spending analysis, investments, savings, budgeting, credit scores, and more.",
  "frontend/src/hooks/useBeneficiaries.ts": "Custom React hook that manages a list of payment beneficiaries (mobile/UPI) with add and remove operations, persisting state to localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout state and identity management for ICP-based auth.",
  "frontend/src/hooks/usePinAuth.ts": "Custom hook for PIN-based authentication that stores a hashed PIN in localStorage and supports biometric toggle and a simulated biometric login flow.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, bank accounts, and transactions via a canister actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for light/dark themes along with reusable component utility classes.",
  "frontend/src/lib/qrcode.ts": "Pure TypeScript QR code generator that produces a 2D boolean matrix using Reed-Solomon error correction, supporting byte mode for small strings up to version 10.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Analytics.tsx": "Analytics page displaying spending/income charts (pie and bar) with period filtering and an integrated AI chatbot panel with quick-reply suggestions.",
  "frontend/src/pages/History.tsx": "Displays a filterable, searchable transaction history page with filters for time period, category, and transaction type (debit/credit), showing summarized totals and a list of TransactionCard components.",
  "frontend/src/pages/Home.tsx": "Main home dashboard showing user greeting, total balance (PIN-protected reveal), quick action buttons (recharge, tickets, send money, check balance), and sections for spending limits, challenges, ads, and feedback.",
  "frontend/src/pages/LoginScreen.tsx": "Login landing page that displays the FinMate branding, feature highlights, and an Internet Identity login button with loading state.",
  "frontend/src/pages/MainApp.tsx": "Root app shell that manages tab state and renders the active page (Home, History, Analytics, or Profile) alongside a persistent BottomNav.",
  "frontend/src/pages/PinEntry.tsx": "PIN entry screen with a numeric keypad, dot indicators, error display, attempt tracking, and biometric authentication fallback for unlocking the app.",
  "frontend/src/pages/PinSetup.tsx": "Two-step PIN creation screen where users enter and confirm a 4–6 digit PIN, with validation and error feedback before calling the onSetup callback.",
  "frontend/src/pages/Profile.tsx": "React page component for the user profile screen, handling bank accounts, leaderboard preferences, theme toggling, referral codes, and logout functionality using various custom hooks and modals.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (oklch-based), typography, container queries, animation plugins, and FinMate-specific design tokens like shadows and gradients.",
  "project_state.json": "Project state metadata for FinMate describing existing features, a known issue with the 'Check Balance' button lacking auth gating, and a pending fix request (AR-1) to require PIN or biometric authentication before revealing the balance."
}