{
  "kind": "build_request",
  "title": "Fix Check Balance on Home page with PIN or fingerprint authentication",
  "projectName": "FinMate",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the 'Check Balance' quick-action button on the Home page so that tapping it triggers a PIN confirmation modal (using PinConfirmationModal) or biometric/fingerprint authentication (using the simulateBiometric helper from usePinAuth) before revealing the balance. The balance must not be visible until the user successfully authenticates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "check balance in home page should be fixed and by pin or fingerprint"
        ]
      },
      "acceptanceCriteria": [
        "Tapping 'Check Balance' on the Home page opens a PIN entry prompt or offers a fingerprint/biometric option.",
        "The balance is only revealed after the user successfully enters their PIN or passes biometric authentication.",
        "If PIN entry is cancelled or fails, the balance remains hidden.",
        "The BalanceCard auto-hides the balance after 30 seconds of visibility (existing behaviour preserved).",
        "The fingerprint/biometric option is shown alongside the PIN option, consistent with the PinEntry screen pattern."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Reuse the existing PinConfirmationModal component and usePinAuth hook; do not create a separate auth mechanism.",
    "The balance display logic in BalanceCard must remain intact; only the trigger/gate on the Home page needs fixing."
  ],
  "nonGoals": [
    "Changing the balance display on the Profile page.",
    "Modifying the backend schema or any Motoko files.",
    "Adding a new PIN setup or PIN change flow.",
    "Altering the FinMateWalletCard show/hide toggle behaviour."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}